Repository: ProjektAdLer/LearningOutcomesGenerator
Catalog: Library/Resources/Pages/CreateStructuredLearningOutcome.*.resx
Languages: de

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.Two.Cell.One
source: relatively general, broad outcomes
de: relativ allgemeine, umfassende Ziele

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.Two.Cell.Three
source: more concrete, subject-specific learning outcomes
de: konkretere, gegenstandsspezifischere Lernziele

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.Two.Cell.Two
source: specific operationalized outcomes to be achieved in a specific learning sequence
de: spezifische operationalisierte Ziele, die in einer bestimmten Lernsequenz erreicht werden sollen

source: Module
de: Modul

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.Three.Cell.One
source: Study course
de: Studiengang

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.Three.Cell.Two
source: Study program / Curriculum
de: Studienprogramm / Curriculum

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.Three.Cell.Six
source: Part of a teaching unit
de: Teil einer Unterrichtseinheit / Lehreinheit

source: Course
de: Lehrveranstaltung

source: Teaching unit
de: Unterrichtseinheit / Lehreinheit

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.RightSidebar.Three
source: Learning Outcomes
de: Definition von Lernzielen

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.RightSidebar.Four
source: Learning outcomes in teaching
de: Verwendung von Lernzielen

# CreateStructuredLearningOutcome.WhatIsALearningOutcomeTaxonomy.Title
source: What is a learning outcome taxonomy?
de: Was ist eine Lernzieltaxonomie?

# CreateStructuredLearningOutcome.WhatIsALearningOutcomeTaxonomy.Info.Text.PartOne
source: Learning outcomes can be assigned to different competence levels. The classification scheme of the learning outcomes taxonomy can be used for this purpose. This serves as a methodical tool for formulating learning outcomes and helps teachers to describe learning outcomes in a competence-oriented way.
de: Lernziele können unterschiedlichen Kompetenzebenen zugeordnet werden. Dazu kann das Klassifikationsschema der Lernzieltaxonomie genutzt werden. Dieses dient als methodisches Werkzeug bei der Formulierung von Lernzielen und hilft Lehrenden dabei, Lernziele kompetenzorientiert zu beschreiben.

# CreateStructuredLearningOutcome.WhatIsALearningOutcomeTaxonomy.Info.Text.PartTwo
source: One of the best-known taxonomies of learning outcomes is Bloom's taxonomy of cognitive learning outcomes (1984), which contains six cognitive process dimensions (also known as learning outcome levels). Anderson and Krathwohl (2001) have further developed Bloom's taxonomy. This further development serves as the basis for AdLer input support and is therefore explained in more detail below.
de: Eine der bekanntesten Lernzieltaxonomien ist die Taxonomie der kognitiven Lernziele von Bloom (1984), welche sechs kognitive Prozessdimensionen (auch: Lernziel-Stufen) beinhaltet. Anderson & Krathwohl (2001) haben die Bloom’sche Taxonomie weiterentwickelt. Diese Weiterentwicklung dient als Grundlage für die AdLer-Eingabeunterstützung und wird deswegen im Folgenden genauer erläutert.

source: The learning outcome taxonomy according to Anderson and Krathwohl
de: Die Lernzieltaxonomie nach Anderson & Krathwohl

source: The various taxonomy levels do not have a precisely defined dependency relationship with each other, but dependencies can also occur. For example, a person cannot judge which of two analysis methods is more suitable for a certain process (“Judge” category) without having understood both methods (“Understand”). On the other hand, it is quite possible for someone to apply a procedure (“Apply”) without having fully understood it (“Understand”).
de: Die verschiedenen Taxonomie-Stufen stehen in keinem genau definierten Abhängigkeitsverhältnis zueinander, jedoch können auch Abhängigkeiten auftreten. Beispielsweise kann eine Person nicht beurteilen, welches von zwei Analyseverfahren für einen bestimmten Prozess besser geeignet ist („Beurteilen“), ohne beide Verfahren verstanden zu haben („Verstehen“). Andererseits ist es durchaus möglich, dass jemand ein Verfahren anwendet („Anwenden“), ohne es vollständig verstanden zu haben („Verstehen“).

source: The following table provides an overview of the different levels of the learning outcome taxonomy according to Anderson and Krathwohl. These are each supplemented by a brief description and exemplary verbs of visibility that indicate the corresponding cognitive process. Verbs of visibility should be used to formulate learning outcomes for the respective abilities, skills and competencies at the corresponding taxonomy level. Depending on the context, a verb of visibility can also be used at different taxonomy levels.
de: Die folgende Tabelle gibt einen Überblick über die verschiedenen Stufen der Lernzieltaxonomie nach Anderson & Krathwohl. Diese sind jeweils ergänzt durch eine kurze Beschreibung und exemplarische Verben der Sichtbarkeit, die auf den entsprechenden kognitiven Prozess hinweisen. Verben der Sichtbarkeit sollten zur Formulierung von Lernzielen für die jeweiligen Kompetenzen auf der entsprechenden Taxonomie-Stufe verwendet werden. Je nach Kontext kann ein Verb der Sichtbarkeit auch in verschiedenen Taxonomie-Stufen verwendet werden.

source: The six taxonomy levels categorize the various cognitive processes that can come into play during learning. This classification describes different levels of complexity of the desired abilities, skills and competencies. The spectrum ranges from simple learning outcomes such as remembering facts to complex processes such as creating new ideas. The learning outcome taxonomy according to Anderson and Krathwohl comprises six taxonomy levels: Remembering, Understanding, Applying, Analyzing, Judging and Creating. Each of these levels represents a specific type of cognitive process. The structure of the taxonomy enables teachers to assign learning outcomes to a level of complexity and to take this into account when formulating the learning outcomes.
de: Die sechs Taxonomie-Stufen kategorisieren die verschiedenen kognitiven Prozesse, die beim Lernen zum Tragen kommen können. Durch diese Klassifikation werden unterschiedliche Komplexitätsebenen der angestrebten Kompetenzen beschrieben. Dabei handelt es sich um ein Spektrum, welches von einfachen Lernzielen wie dem Erinnern von Fakten bis hin zu komplexen Prozessen wie dem Erschaffen neuer Ideen reicht. Die Lernzieltaxonomie nach Anderson & Krathwohl umfasst die sechs Taxonomie-Stufen: Erinnern, Verstehen, Anwenden, Analysieren, Beurteilen und Erschaffen. Jede dieser Stufen repräsentiert eine bestimmte Art eines kognitiven Prozesses. Die Struktur der Taxonomie ermöglicht es Lehrenden, Lernziele einer Komplexitätsebene zuzuordnen und diese bei der Formulierung der Lernziele einfließen zu lassen.

source: Taxonomy level
de: Taxonomiestufe

source: Example verbs
de: Beispiel-Verben

source: Description
de: Beschreibung

source: Remember
de: Erinnern

source: Evaluate
de: Beurteilen

source: Analyze
de: Analysieren

source: Create
de: Erschaffen

source: Apply
de: Anwenden

source: Understand
de: Verstehen

source: Remembering is the ability to recall or repeat information without necessarily understanding it. This involves accessing relevant knowledge in long-term memory.
de: Erinnern ist die Fähigkeit sich Informationen gegenwärtig zu machen bzw. sie zu wiederholen, ohne sie notwendigerweise zu verstehen. Dabei wird auf relevantes Wissen im Langzeitgedächtnis zugegriffen.

source: Understanding is the ability to comprehend and interpret information (in oral, written or graphic form).
de: Verstehen ist die Fähigkeit Informationen (in mündlicher, schriftlicher oder grafischer Form) zu begreifen und zu interpretieren.

source: Application can be defined as the ability to carry out or use a learned sequence of actions (a pattern, a method) in a specific situation.
de: Anwenden kann als Fähigkeit definiert werden, einen erlernten Handlungsablauf (ein Schema, eine Methode) in einer bestimmten Situation ausführen oder verwenden zu können.

source: Analyzing can be described as the ability to break down learning content into its constructed elements and determine how these are connected/related to each other to form an overarching structure or purpose.
de: Analysieren kann als die Fähigkeit bezeichnet werden, Lerninhalte in ihre konstruierten Elemente zu zerlegen und zu bestimmen, wie diese untereinander zu einer übergreifenden Struktur oder einem übergreifende Zweck verbunden sind/in Beziehung stehen.

source: Judging is the ability to evaluate the significance, quality or value of something based on criteria or standards.
de: Beurteilen ist die Fähigkeit die Bedeutung, die Qualität oder den Wert einer Sache aufgrund von Kriterien oder Standards zu bewerten.

source: Creating is the ability to assemble elements into a coherent or functioning whole or to combine elements into a new pattern or structure.
de: Erschaffen ist die Fähigkeit Elemente zu einem kohärenten oder funktionierenden Ganzen zusammensetzen bzw. Elemente zu einem neuen Muster oder einer neuen Struktur zusammenfügen.

source: enumerate, name, define, reproduce
de: aufzählen, benennen, definieren, wiedergeben

source: describe, represent, explain, summarize
de: beschreiben, darstellen, erklären, zusammenfassen

source: calculate, edit, operate, carry out
de: ausrechnen, bearbeiten, bedienen, durchführen

source: select, test, compare, examine
de: auswählen, testen, vergleichen, untersuchen

source: give reasons, decide, evaluate, classify
de: begründen, entscheiden, evaluieren, klassifizieren

source: design, develop, construct, assembling
de: entwerfen, entwickeln, konstruieren, zusammensetzen

source: Table: Learning outcomes taxonomy according to Anderson and Krathwohl
de: Tabelle: Lernzieltaxonomie nach Anderson & Krathwohl

# CreateStructuredLearningOutcome.WhatIsALearningOutcomeTaxonomy.RightSidebar.One
source: What is a learning outcomes taxonomy?
de: Was ist eine Lernzieltaxonomie?

# CreateStructuredLearningOutcome.WhatIsALearningOutcomeTaxonomy.RightSidebar.Two
source: Learning outcome taxonomy according to Anderson & Krathwohl
de: Lernzieltaxonomie nach Anderson & Krathwohl

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.RightSidebar.One
source: What are learning outcomes?
de: Was sind Lernziele?

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Title
source: How are learning outcomes formulated?
de: Wie werden Lernziele formuliert?

source: Learning outcomes describe what students should know and be able to do at the end of a learning stage or learning process and what attitudes are expected of them. Learning outcomes are therefore the most precise description possible of the intended learning outcomes. In practice, however, learning outcomes are rarely formulated in module handbooks or learning process descriptions; instead, they tend to be presented in a chapter structure that primarily describes the content.
de: Lernziele beschreiben, was Studierende am Ende eines Lernabschnitts bzw. Lernprozesses wissen und können sollen sowie welche Einstellungen von ihnen erwartet werden. Lernziele sind damit die möglichst exakte Beschreibung der angestrebten Lernergebnisse.

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Part1
source: In order for learning outcomes to be effective in promoting learning, they must be formulated according to certain principles and communicated to students.
de: Damit Lernziele ihre lernfördernde Wirkung entfalten können, müssen sie nach bestimmten Grundsätzen formuliert und den Studierenden kommuniziert werden.

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Part2
source: Core elements for learning outcomes are a content-related and a process-related component:
de: Kernelemente für Lernziele sind eine inhaltliche und eine prozessuale Komponente:

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Part2.List1
source: The content component describes the subject-specific or interdisciplinary content to which the student's learning process relates.
de: Die Inhaltskomponente beschreibt den fachlichen oder überfachlichen Inhalt, auf den sich der Lernprozess der Studierenden bezieht.

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Part2.List2
source: The process component refers to an observable action that students are expected to perform. The reason for this is that the achievement of a learning outcome can only be recognized by an action of the student.
de: Die Prozesskomponente nennt eine beobachtbare Handlung, die Studierende ausführen sollen. Der Grund dafür ist, dass die Erreichung eines Lernziels nur durch eine Handlung des/der Studierenden erkennbar ist.

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Aspects
source: Reis (2013 ) lists five aspects that should be considered when formulating a learning outcome:
de: Reis (2013) nennt fünf Aspekte, welche bei der Formulierung eines Lernziels beachtet werden sollten:

source: Realistic requirements:
de: Realistische Anforderungen:

source: Verifiable standards:
de: Überprüfbare Standards:

source: Verb of visibility:
de: Verb der Sichtbarkeit:

source: Name specific activity:
de: Konkrete Tätigkeit benennen:

source: Students' perspective:
de: Perspektive der Studierenden:

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Aspect.Five
source: In order for learning outcomes to have a guiding effect, they must not be formed solely according to the criterion of completeness. Each learning outcome is assigned a learning process that requires time for the necessary action steps. Too extensive or too many learning outcomes with too little time mean that the instructional components are increased. This leads to the learning activities being compensated for by teaching interventions.
de: Jedem Lernziel ist ein Lernprozess zugeordnet, der Zeit für die notwendigen Handlungsschritte benötigt. Zu umfangreiche oder zu viele Lernziele bei zu wenig Zeit haben zur Folge, dass die Instruktionsanteile erhöht werden. Dies führt dazu, dass die Lerntätigkeiten durch Lehrinterventionen kompensiert werden.

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Aspect.Four
source: A learning outcome should describe an action in such a way that it can be evaluated with clear criteria. If the declarative sentence is transformed into an imperative sentence, this should result in a clear examination task that describes what is to be done, with what and for what purpose. This aspect is important so that it is clear that the students can actually carry out the required action. In an examination, it is only possible to prove that students have understood something if they do something, e.g. reproduce a definition, apply a formula or analyze a case study. This point is important so that it is clear that students can actually perform the required action.
de: Ein Lernziel sollte eine Handlung so beschreiben, dass man sie mit klaren Kriterien bewerten kann. Wenn der Aussagesatz in einen Imperativsatz umgeformt wird, sollte daraus ein klarer Prüfungsauftrag entstehen, der beschreibt, was, womit und wozu zu tun ist. Dieser Aspekt ist wichtig, damit deutlich wird, dass die Studierenden die geforderte Handlung tatsächlich ausführen können. In einer Prüfung lässt sich nur nachweisen, ob Studierende etwas verstanden haben, wenn sie etwas tun, z.B. eine Definition wiedergeben, eine Formel anwenden oder ein Fallbeispiel analysieren. Dieser Punkt ist bedeutsam, damit deutlich wird, dass die Studierenden die geforderte Handlung tatsächlich ausführen können.

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Aspect.One
source: The learning outcomes must be formulated as a learning activity. It is not enough for the students to simply be the grammatical subject of the sentence. Phrases such as “The students get to know...” or “The students learn...” represent hidden teaching interventions because the activity lies with the teacher.
de: Die Lernziele müssen als Lerntätigkeit formuliert sein. Dabei reicht es nicht aus, dass die Studierenden lediglich das grammatikalische Subjekt des Satzes sind. Formulierungen wie „Die Studierenden lernen kennen…“ oder „Die Studierenden erfahren…“ stellen verdeckte Lehrinterventionen dar, weil die Aktivität bei den Lehrenden liegt.

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Aspect.Two
source: The learning outcomes must be formulated as specifically as possible. The sequence of the required activity should be understandable from the outside. A clearly described action structure helps students to better understand the requirements so that they can orient themselves in the learning process.
de: Die Lernziele müssen so konkret wie möglich formuliert werden. Der Ablauf der notwendigen Tätigkeit sollte von außen verständlich sein. Eine klar beschriebene Handlungsstruktur hilft den Studierenden, die Anforderungen besser zu verstehen, sodass sie sich im Lernprozess daran orientieren können.

# CreateStructuredLearningOutcome.HowAreLearningOutcomesFormulated.Aspect.Three
source: In order to be able to link the teaching interventions with the students' actions, “verbs of visibility” must be used in the formulation of the learning outcome. These are verbs that describe what the students should “do” with the learning content. Verbs such as “understand” or “recognize” are unsuitable as they do not make the performance of the action clear. Formulations such as “The students understand the basics of...” are not very helpful, as the question arises: What action is meant here? Similarly, only one verb should be used per learning outcome.
de: Um die Lehrinterventionen mit dem Handeln der Studierenden verknüpfen zu können, müssen in der Formulierung des Lernziels „Verben der Sichtbarkeit“ verwendet werden. Dabei handelt es sich um Verben, die beschreiben, was die Studierenden mit dem Lerninhalt „machen“ sollen. Verben wie „verstehen“ oder „erkennen“ sind ungeeignet, da sie die Performanz der Handlung nicht klar machen. Formulierungen wie „Die Studierenden verstehen die Grundlagen von…“ sind wenig hilfreich, denn es stellt sich die Frage: Welche Handlung ist hier gemeint? Ebenso sollte pro Lernziel nur ein Verb genutzt werden.

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Title
source: The "what-whereby-what-for" structure
de: Die "Was-Womit-Wozu-Struktur"

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Part1
source: In principle, the formulation of a learning outcome can be based on a systematic sentence structure: Subject, learning outcome (and context) and verb of visibility.
de: Grundsätzlich kann man sich bei der Formulierung eines Lernziels an einem systematischen Satzbau orientieren: Subjekt, Lernziel (und Kontext) sowie Verb der Sichtbarkeit.

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Text.Image
source: The following example illustrates this:
de: Folgendes Beispiel verdeutlicht dies:

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.DescriptionText.Image
source: Figure: (1) subject, (2) learning outcome (and context), (3) verb of visibility
de: Abbildung: (1) Subjekt, (2) Lernziel (und Kontext), (3) Verb der Sichtbarkeit

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Part3
source: Applying this structure to the above example of a learning outcome results in the following extension:
de: Wendet man diese Struktur auf das o.g. Beispiel für ein Lernziel an, dann ergibt sich folgende Erweiterung:

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Part2
source: The quality of a learning outcome can be further enhanced with the help of the “what-with-what-for” structure. A description can be found in the following table:
de: Die Qualität eines Lernziels kann mit Hilfe der „Was-Womit-Wozu-Struktur“ weiter erhöht werden. Eine Beschreibung findet sich in der folgenden Tabelle:

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.DescriptionText.Table
source: Table: What-whereby-what-for structure
de: Tabelle: Was-Womit-Wozu-Struktur

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Two
source: Description
de: Beschreibung

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.One
source: Structure
de: Struktur

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Three
source: Key questions
de: Leitfragen

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.One.Cell.One
source: What?
de: Was?

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.One.Cell.Three
source: What for?
de: Wozu?

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.One.Cell.Two
source: Whereby?
de: Womit?

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Two.Cell.Two
source: The “whereby” describes the theoretical or practical tools students use to carry out their actions. These are, for example, formulas, models, plans, concepts, tools, etc., which are taught during the course and whose application is practiced. The use and linking of these tools forms the basis for competent action.
de: Das „Womit“ beschreibt, mit Hilfe welcher theoretischen oder praktischen Werkzeuge Studierende ihre Handlungen ausführen. Hierbei handelt es sich beispielsweise um Formeln, Modelle, Pläne, Begriffe, Tools etc., die im Verlauf der Lehrveranstaltung vermittelt werden und deren Anwendung geübt wird. Die Verwendung und Verknüpfung dieser Werkzeuge bildet die Grundlage für kompetentes Handeln.

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Two.Cell.One
source: The “what” indicates which learning content (content-related topic) is addressed as part of the students' acquisition of skills. In conjunction with a verb of visibility and the corresponding taxonomy level, it describes an ability, skill or competence that students should have developed at the end of the learning process. The “what” corresponds to the above-mentioned systematic sentence structure of a learning outcome.
de: Das „Was“ sagt aus, welcher Lerninhalt (inhaltliches Thema) im Rahmen des Kompetenzerwerbs der Studierenden adressiert wird. In Verbindung mit einem Verb der Sichtbarkeit und der dazugehörigen Taxonomiestufe beschreibt es eine Kompetenz, welche Studierende am Ende des Lernprozesses entwickelt haben sollen. Das „Was“ entspricht dem systematischen Satzbau eines Lernziels.

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Two.Cell.Three
source: The “What for” provides an outlook on the purpose for which the learning unit was designed. The focus is not on the exam. Rather, the “What for” illustrates the students' options for action once they have mastered what they have learned. Often the action or situation of the “what for” takes place in a more complex environment and under more difficult conditions than in the learning situation. The “what for” does not refer to the examination.
de: Das „Wozu“ gibt einen Ausblick auf den Sinn und Zweck, für den die Lerneinheit konzipiert wurde. Es veranschaulicht die Handlungsmöglichkeiten der Studierenden, wenn sie das Gelernte sicher beherrschen. Oftmals findet die Handlung oder die Situation des „Wozu“ in einer komplexeren Umgebung und unter schwierigeren Bedingungen statt, als in der Lernsituation. Das „Wozu“ bezieht sich nicht auf die Prüfung.

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Three.Cell.One
source: What exactly can students do at the end of the course?
de: Was genau können die Studierenden am Ende der Lehrveranstaltung tun?
