Repository: ProjektAdLer/LearningOutcomesGenerator
Catalog: Library/Resources/Pages/CreateStructuredLearningOutcome.*.resx
Languages: de

# CreateStructuredLearningOutcome.Title
source: AdLer input support
de: AdLer-Eingabeunterstützung

# CreateStructuredLearningOutcome.QualityCheck.Title
source: Quality check
de: Qualitätscheck

# CreateStructuredLearningOutcome.Info.Text
source: In the context of competency-based higher education and the associated shift in perspective from "teaching to learning", learning objectives have also come into focus. Learning objectives are also the most precise description of the desired learning outcomes. Learning outcomes describe what students should know and be able to do at the end of a learning section and what attitudes are expected of them. They are recorded in writing and communicated in a situational manner. The what-whereby-what-for-structure and taxonomy of learning objectives (e.g. according to Anderson/Krathwohl) are helpful in this context, to select appropriate verbs for formulating learning outcomes on the basis of different levels of competence.
de: Im Zusammenhang mit der kompetenzorientierten Hochschullehre und den damit verbundenen Perspektivwechsel "from Teaching to Learning" und "vom Input zum Output" sowie der steigenden Relevanz der Studierendenzentrierung, haben Lernziele große Aufmerksamkeit erlangt.

# CreateStructuredLearningOutcome.Button.Create
source: Create
de: Erstellen

# CreateStructuredLearningOutcome.TaxonomyLevel.NotSpecified
source: Not specified
de: Keine Angabe

# CreateStructuredLearningOutcome.TaxonomyLevel
source: Taxonomy level
de: Taxonomiestufe

# CreateStructuredLearningOutcome.TaxonomyLevel.Info
source: The formulation of a learning outcome focuses on the description of corresponding abilities, skills or competencies of the intended learning process of the students. These can be assigned to a taxonomy level based on the complexity of the cognitive processes. The definition of a taxonomy level (according to Anderson & Krathwohl) serves to find a suitable verb of visibility in the further processing steps of the learning outcome formulation.
de: Die Formulierung eines Lernziels fokussiert die Beschreibung von entsprechenden Kompetenzen innerhalb des intendierten Lernprozesses der Studierenden. Diese lassen sich aufgrund ihrer Komplexität der kognitiven Prozesse einer Taxonomiestufe zuordnen. Die Festlegung einer Taxonomiestufe (nach Anderson & Krathwohl) dient in den weiteren Bearbeitungsschritten der Lernziel-Formulierung zum Finden eines passenden Verbes der Sichtbarkeit.

# CreateStructuredLearningOutcome.Intro
source: You will be able to...
de: Die Studierenden können...

# CreateStructuredLearningOutcome.VerbOfVisibility
source: Verb of visibility*
de: Verb der Sichtbarkeit*

# CreateStructuredLearningOutcome.VerbOfVisibility.Info
source: The learning outcome describes desired behavioral dispositions and which abilities, skills or competencies the students will have developed at the end of the learning process. It therefore describes actions that are formulated with the help of verbs of external visibility. These represent an action on or with an external object. Verbs such as "understand" or "recognize" are therefore not suitable. The verbs of external visibility can be assigned to a taxonomy level.
de: Das Lernziel beschreibt, welche Kompetenzen die Studierenden am Ende des Lernprozesses entwickelt haben werden. Es beschreibt Handlungen, welche mit Hilfe von Verben der Sichtbarkeit formuliert werden. Diese stellen ein Tun an oder mit einem äußeren Objekt dar. Verben wie „verstehen“ oder „erkennen“ sind deshalb nicht geeignet. Die Verben der Sichtbarkeit lassen sich einer Taxonomiestufe zuordnen.

# CreateStructuredLearningOutcome.VerbOfVisibility.Placeholder
source: Formulate or select
de: Formulieren oder auswählen

# CreateStructuredLearningOutcome.VerbOfVisibility.RequiredError
source: Specification of the verb is necessary
de: Angabe des Verbes ist notwendig

# CreateStructuredLearningOutcome.What.RequiredError
source: Specification of "What" is necessary
de: Angabe von „Was" ist notwendig

# CreateStructuredLearningOutcome.What.Placeholder
source: Text field
de: Textfeld

# CreateStructuredLearningOutcome.What
source: What? (Topic)*
de: Was? (Thema)*

# CreateStructuredLearningOutcome.What.Info
source: The "What" states which learning content (content-related topic) is to be addressed as part of the students' competence acquisition. In the following steps, this is further formulated into a corresponding ability, skill or competence with the help of a taxonomy level and a verb of visibility.
de: Das „Was“ sagt aus, welcher Lerninhalt (inhaltliches Thema) im Rahmen des Kompetenzerwerbs der Studierenden adressiert wird. In Verbindung mit einem Verb der Sichtbarkeit und der dazugehörigen Taxonomiestufe beschreibt es eine Kompetenz, welche Studierende am Ende des Lernprozesses entwickelt haben sollen. Das „Was“ entspricht dem o.g. systematischen Satzbau eines Lernziels.

# CreateStructuredLearningOutcome.Whereby.Placeholder
source: Text field
de: Textfeld

# CreateStructuredLearningOutcome.Whereby.Text
source: by...
de: indem sie...

# CreateStructuredLearningOutcome.Whereby
source: Whereby?
de: Womit?

# CreateStructuredLearningOutcome.Whereby.Info
source: The "with what" describes the theoretical or practical tools students use to carry out their actions. These are, for example, formulas, models, plans, concepts, tools, etc., which are taught during the course and whose application is practiced. The use and linking of these tools forms the basis for competent action. A helpful question when formulating this is: "How do students achieve the ability, skill or competence?".
de: Das „Womit“ beschreibt, mit Hilfe welcher theoretischen oder praktischen Werkzeuge Studierende ihre Handlungen ausführen. Hierbei handelt es sich beispielsweise um Formeln, Modelle, Pläne, Begriffe, Tools etc., die im Verlauf der Lehrveranstaltung vermittelt werden und deren Anwendung geübt wird. Die Verwendung und Verknüpfung dieser Werkzeuge bildet die Grundlage für kompetentes Handeln.

# CreateStructuredLearningOutcome.WhatFor.Placeholder
source: Text field
de: Textfeld

# CreateStructuredLearningOutcome.WhatFor.Text
source: to...
de: um...

# CreateStructuredLearningOutcome.WhatFor.Info
source: The "What for" provides an outlook on the purpose for which the learning unit was designed. The focus is not on the exam. Rather, the "What for" illustrates the students' options for action once they have mastered what they have learned. The action or situation of the "what for" often takes place in a more complex environment and under more difficult conditions than in the learning situation. Helpful questions when formulating this are: "For what (concrete and/or long-term) purpose should the competencies be acquired?" and/or "What do students need the acquired skills, abilities or competencies for after the course?".
de: Das „Wozu“ gibt einen Ausblick auf den Sinn und Zweck, für den die Lerneinheit konzipiert wurde. Es veranschaulicht die Handlungsmöglichkeiten der Studierenden, wenn sie das Gelernte sicher beherrschen. Oftmals findet die Handlung oder die Situation des „Wozu“ in einer komplexeren Umgebung und unter schwierigeren Bedingungen statt, als in der Lernsituation. Das „Wozu“ bezieht sich nicht auf die Prüfung.

# CreateStructuredLearningOutcome.WhatFor
source: What for?
de: Wozu?

# CreateStructuredLearningOutcome.Text
source: First, think about the taxonomy level at which you want to formulate your learning outcome.
de: 1. Machen Sie sich zunächst Gedanken, auf welcher Taxonomiestufe Sie Ihr Lernziel formulieren möchten.

# CreateStructuredLearningOutcome.Preview
source: Preview of the formulated learning outcome:
de: Vorschau des formulierten Lernziels:

# CreateStructuredLearningOutcome.Reset
source: Reset entries
de: Eingaben zurücksetzen

# CreateStructuredLearningOutcome.Required
source: * Required
de: * Erforderliche Angabe

# CreateStructuredLearningOutcome.TaxonomyLevel.Remember
source: Accessing relevant knowledge in long-term memory
de: Auf relevantes Wissen im Langzeitgedächtnis zugreifen

# CreateStructuredLearningOutcome.Example
source: Example of a learning outcome formulation
de: Beispiel für eine Lernziel-Formulierung

# CreateStructuredLearningOutcome.TaxonomyLevel.Create
source: Assemble elements into a coherent structure or pattern
de: Elemente zu einer zusammenhängenden Struktur oder zu einem zusammenhängenden Muster zusammenfügen

# CreateStructuredLearningOutcome.TaxonomyLevel.Understand
source: Assign meaning to information (oral, written or graphic) in the learning unit
de: Informationen (mündlich, schriftlich oder grafisch) in der Lerneinheit Bedeutung zuordnen

# CreateStructuredLearningOutcome.TaxonomyLevel.Apply
source: Apply a course of action or a method in a specific situation
de: Einen Handlungsablauf oder eine Methode in einer bestimmten Situation anwenden

# CreateStructuredLearningOutcome.TaxonomyLevel.Analyse
source: Break down learning content into its elements and determine their connection to an overarching structure or purpose
de: Lerninhalte in ihre Elemente zerlegen und ihre Verbindung zu einer übergreifenden Struktur oder einem übergreifenden Zweck bestimmen

# CreateStructuredLearningOutcome.TaxonomyLevel.Evaluate
source: Make judgments based on criteria or standards
de: Urteile aufgrund von Kriterien oder Standards abgeben

# CreateStructuredLearningOutcome.Button.Edit
source: Update
de: Aktualisieren

# CreateStructuredLearningOutcome.CopyToClipboard.Success
source: Your formulated learning objective has been successfully copied to the clipboard.
de: Ihr formuliertes Lernziel wurde erfolgreich in die Zwischenablage kopiert.

# CreateStructuredLearningOutcome.CopyToClipboard.Failure
source: Error when copying to the clipboard. Alternatively, select and copy your formulated learning objective/learning outcome in the preview window.
de: Fehler beim Kopieren in die Zwischenablage. Markieren und kopieren Sie alternativ Ihr formuliertes Lernziel im Vorschaufenster.

# CreateStructuredLearningOutcome.ExampleImagePath
source: /CustomIcons/Beispiel-Lernziel_AT-en_LO-en.png
de: /CustomIcons/Beispiel.png

# CreateStructuredLearningOutcome.Copy
source: Copy to clipboard
de: In die Zwischenablage kopieren

# CreateStructuredLearningOutcome.WhatIsConstructiveAlignment.Part1
source: Constructive alignment according to Biggs (2011) is a didactic principle that is used particularly in higher education didactics. It aims to align teaching/learning activities and performance assessments with the objectives of teaching/learning units. Teachers plan their courses in such a way that there is a coherent connection between learning objectives, teaching/learning activities and performance assessments.
de: Das Constructive Alignment nach Biggs (2011) (deutsch: „Konstruktive Abstimmung“) ist ein didaktisches Prinzip, das besonders in der Hochschuldidaktik Anwendung findet. Es zielt darauf ab, die Lehr-/Lernaktivitäten und Leistungsüberprüfungen mit den Zielen von Lehr-/Lerneinheiten abzustimmen. Dabei planen die Lehrenden ihre Lehrveranstaltungen so, dass eine zusammenhängende Verbindung zwischen Lernzielen, Lehr-/Lernaktivitäten und Leistungsüberprüfung entsteht.

# CreateStructuredLearningOutcome.WhatIsConstructiveAlignment.Text.Image
source: The illustration shows the connection between the three components and key questions that teachers should ask themselves when designing the course.
de: Die Abbildung zeigt die Verbindung der drei Komponenten und Leitfragen, welche sich Lehrende bei der Konzeption stellen sollten.

# CreateStructuredLearningOutcome.WhatIsConstructiveAlignment.Part3
source: This approach creates a cognitive process in which the dimensions of learning outcomes, performance assessment and learning activities are aligned with each other and are therefore coherent. The stronger this alignment is, the greater the potential of the course to promote learning and expand students' skills.
de: Durch diese Vorgehensweise entsteht ein kognitiver Prozess, bei dem die Dimensionen Lernziele, Leistungsüberprüfung und Lernaktivitäten aufeinander abgestimmt werden und dadurch zusammenhängend sind. Je stärker diese Übereinstimmung ist, desto größer ist das Potenzial der Veranstaltung, das Lernen zu fördern und die Kompetenzen der Studierenden zu erweitern.

# CreateStructuredLearningOutcome.WhatIsConstructiveAlignment.Title
source: What is constructive alignment?
de: Was versteht man unter Constructive Alignment?

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Title
source: What are learning outcomes?
de: Was sind Lernziele?

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Part1
source: In the literature, other terms are also used as an alternative to the term learning outcome, such as learning result or the English terms learning output and learning outcome. However, the terms are often used interchangeably, resulting in a labyrinth of terminological confusion. For this reason, the term learning outcome is used consistently in the context of AdLer input support.
de: In der Literatur werden alternativ zu dem Begriff Lernziel auch noch andere Bezeichnungen, wie Lernergebnis oder die englischen Benennungen Learning Output und Learning Outcome genutzt. Oftmals werden die Begriffe jedoch austauschbar verwendet, sodass ein Labyrinth terminologischer Unklarheiten entsteht. Aus diesem Grund wird im Rahmen der AdLer-Eingabeunterstützung durchgängig der Begriff Lernziel verwendet.

# CreateStructuredLearningOutcome.WhyLearningOutcomesInTeaching.Title
source: Why is the use of learning outcomes in teaching important?
de: Warum ist die Verwendung von Lernzielen in der Lehre wichtig?

# CreateStructuredLearningOutcome.WhyLearningOutcomesInTeaching.Part1
source: benefit from the use of constructive alignment. By formulating learning outcomes precisely, they gain clarity about their intentions, which guide their actions when planning, implementing and evaluating teaching. Without clear formulation, many of the teachers' learning outcomes remain unspoken and are therefore difficult to reflect on. As a result, they cannot be used as a teaching design tool, or only to a limited extent. In addition, the use of learning objectives creates the basis for student-centered teaching, as teachers consciously deal with and reflect on the orientation of teaching and the subsequent formulation of learning outcomes.
de: Lehrende profitieren von der Nutzung des Constructive Alignment. Durch die präzise Formulierung der Lernziele gewinnen sie Klarheit über ihre Intentionen, welche ihr Handeln bei der Planung, Durchführung und Evaluation der Lehre steuern. Ohne klare Formulierung bleiben viele Lernziele der Lehrenden unausgesprochen und sind daher schwer zu reflektieren. Dadurch können diese nicht oder nur eingeschränkt als Hilfsmittel zur Gestaltung der Lehre genutzt werden. Zudem schafft die Verwendung von Lernzielen die Grundlage für eine studierendenzentrierte Lehre, da Lehrende sich bewusst mit der Ausrichtung der Lehre und der anschließenden Formulierung von Lernzielen auseinandersetzen und diese reflektieren.

# CreateStructuredLearningOutcome.WhyLearningOutcomesInTeaching.Part2
source: can better understand the objectives of a course by using learning outcomes. Learning outcomes can therefore be used as a means of communication to avoid misunderstandings between teachers and students, as the course or teaching unit becomes more transparent and comprehensible. This promotes learning success.
de: Studierende können durch die Verwendung von Lernzielen die Ziele einer Lehrveranstaltung besser nachvollziehen. Lernziele können also als Kommunikationsmittel genutzt werden, um Missverständnisse zwischen Lehrenden und Studierenden zu vermeiden, da die Lehrveranstaltung oder eine Unterrichtseinheit/Lehreinheit eine bessere Transparenz und Nachvollziehbarkeit gewinnt. Dies fördert den Lernerfolg.

# CreateStructuredLearningOutcome.QualityCheck.One
source: Who is the real protagonist in the plot?
de: Sind die Studierenden die wirklichen Akteur:innen der Handlung?

# CreateStructuredLearningOutcome.QualityCheck.Two
source: Is the process of the activity understandable for outsiders?
de: Ist der Ablauf der Tätigkeit für Außenstehende verständlich?

# CreateStructuredLearningOutcome.QualityCheck.Three
source: Do the verbs describe an action on/with an external learning object?
de: Beschreiben die Verben ein Tun an/mit einem äußeren Lernobjekt?

# CreateStructuredLearningOutcome.QualityCheck.Four
source: Can an audit assignment be formulated from the statement sentence?
de: Lässt sich aus dem Aussagesatz ein Prüfungsauftrag formulieren?

# CreateStructuredLearningOutcome.QualityCheck.Five
source: Is the amount of work involved in the learning process proportionate?
de: Steht der Arbeitsaufwand des Lernprozesses in einem angemessenen Verhältnis?

# CreateStructuredLearningOutcome.QualityCheck.Six
source: Are the theoretical or practical tools for the action named?
de: Werden die theoretischen oder praktischen Werkzeuge für die Handlung benannt?

# CreateStructuredLearningOutcome.QualityCheck.Seven
source: Is it clear what purpose the learning unit serves?
de: Wird deutlich, welchem Sinn und Zweck die Lerneinheit dient?

# CreateStructuredLearningOutcome.QualityCheck.Subtitle
source: Reflection questions to check high-quality formulated learning outcomes:
de: Reflexionsfragen zur Überprüfung von hochwertig formulierten Lernzielen:

# CreateStructuredLearningOutcome.Website
source: Website for the AdLer project
de: Website zum Projekt AdLer

# CreateStructuredLearningOutcome.TabPanelOne
source: Input support for formulating learning outcomes
de: Eingabeunterstützung zur Lernziel-Formulierung

# CreateStructuredLearningOutcome.TabPanelTwo
source: What are learning outcomes?
de: Was sind Lernziele?

# CreateStructuredLearningOutcome.TabPanelFour
source: How are learning outcomes formulated?
de: Wie werden Lernziele formuliert?

# CreateStructuredLearningOutcome.TabPanelThree
source: What is a learning outcome taxonomy?
de: Was ist eine Lernzieltaxonomie?

# CreateStructuredLearningOutcome.Sources
source: Sources
de: Quellen

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.DescriptionText.Table
source: Table: Goal types and training level
de: Tabelle: Zielarten und Ausbildungsebene

source: Figure: Constructive Alignment
de: Abbildung: Constructive Alignment

# CreateStructuredLearningOutcome.WhatIsConstructiveAlignment.Part2
source: For teachers, this means that they first formulate learning outcomes when planning their courses and use these as a basis. The corresponding performance assessments are then designed to check whether the competencies have been achieved. The third step is to select the learning activities that best support students on their way to achieving the learning outcomes.
de: Für Lehrende bedeutet dies, dass sie bei der Planung ihrer Veranstaltungen zunächst Lernziele formulieren und diese als Grundlage nutzen. Anschließend werden die entsprechenden Leistungsüberprüfungen entworfen, um das Erreichen der Kompetenzen zu überprüfen. Im dritten Schritt werden die Lernaktivitäten ausgewählt, welche die Studierenden optimal auf ihrem Weg zu den Lernzielen unterstützen.

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Part2
source: Learning outcomes describe what students should know and be able to do at the end of a learning stage or learning process and what attitudes are expected of them. Learning outcomes are therefore the most precise description possible of the intended learning results. They are recorded in written form and communicated as appropriate to the situation. Learning outcomes can be assigned to different levels of competence. The classification scheme of the learning outcomes taxonomy can be used for this purpose (see section “What is a learning outcomes taxonomy?”).
de: Lernziele beschreiben, was Studierende am Ende eines Lernabschnitts bzw. Lernprozesses wissen und können sollen sowie welche Einstellungen von ihnen erwartet werden. Lernziele sind damit die möglichst exakte Beschreibung der angestrebten Lernergebnisse. Sie werden in schriftlicher Form festgehalten und situationsgerecht kommuniziert.

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Part3
source: Learning outcomes can also be differentiated according to their degree of concretization and the duration of the training unit (e.g. an entire module or a single teaching unit). As the duration of the training unit decreases, the degree of concretization increases. Or vice versa: the longer the training unit, the higher the degree of abstraction of the learning outcomes. A distinction can be made between indicative, broad and detailed outcomes.
de: Lernziele können zudem anhand ihres Konkretisierungsgrades und der Dauer der Ausbildungseinheit (z.B. ein ganzes Modul oder eine einzelne Lehreinheit) unterschieden werden. Mit abnehmender Dauer der Ausbildungseinheit nimmt der Konkretisierungsgrad zu. Oder umgekehrt: Je höher die Ausbildungseinheit, desto höher ist der Abstrahierungsgrad der Lernziele. Es kann dabei zwischen Richt-, Grob- und Feinzielen unterschieden werden.

# CreateStructuredLearningOutcome.WhyLearningOutcomesInTeaching.Part1.Italic
source: Teachers
de: Lehrende

# CreateStructuredLearningOutcome.WhyLearningOutcomesInTeaching.Part2.Italic
source: Students
de: Studierende

# CreateStructuredLearningOutcome.WhyLearningOutcomesInTeaching.Part3
source: Learning outcomes usually have a positive effect indirectly: while effective learning time has a direct positive effect on learning success, clearly formulated learning outcomes mean that students use more class time effectively as learning time. In addition, clearly formulated learning outcomes enable students to engage with the learning content in a more targeted manner.
de: Lernziele entfalten ihre positive Wirkung meist indirekt: Während sich effektive Lernzeit direkt positiv auf den Lernerfolg auswirkt, führen klar formulierte Lernziele dazu, dass die Studierenden mehr Unterrichtszeit effektiv als Lernzeit nutzen. Außerdem ermöglichen klar formulierte Lernziele den Studierenden, sich gezielter mit den Lerninhalten auseinanderzusetzen.

# CreateStructuredLearningOutcome.WhyLearningOutcomesInTeaching.Part4
source: It is also crucial for student-centered teaching that students accept the defined learning outcomes and actively engage with them. Well-formulated learning outcomes can positively influence student engagement through increased transparency. They serve as a meaningful starting point for students to shape their learning process in an effective and self-directed manner.
de: Ebenso ist es für eine studierendenzentrierte Lehre entscheidend, dass die Studierenden die definierten Lernziele annehmen und sich aktiv damit auseinandersetzen. Gut formulierte Lernziele können durch eine erhöhte Transparenz das Engagement der Studierenden positiv beeinflussen. Sie dienen als sinnvoller Ausgangspunkt für die Studierenden, um ihren Lernprozess effektiv und selbstgesteuert zu gestalten.

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.One
source: Outcome type
de: Zielart

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.Three
source: Training level
de: Ausbildungsebene

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.Two
source: Description
de: Beschreibung

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.One.Cell.One
source: Reference outcome
de: Richtziel

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.One.Cell.Three
source: Broad outcome
de: Grobziel

# CreateStructuredLearningOutcome.WhatAreLearningOutcomes.Table.Col.One.Cell.Two
source: Detailed outcome
de: Feinziel
