Repository: ProjektAdLer/LearningOutcomesGenerator
Catalog: Library/Resources/Pages/CreateStructuredLearningOutcome.*.resx
Languages: de

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Three.Cell.Two
source: How do students achieve the ability, skill or competence?
de: Womit erreichen die Studierenden die Kompetenz?

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Three.Cell.Three
source: What “tools” do students use to exercise the competencies?
de: Welche „Werkzeuge“, die zur Ausübung der Kompetenzen benötigt werden, nutzen die Studierenden?

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Three.Cell.Four
source: For what (specific and/or long-term) purpose should the skills be acquired?
de: Für welchen (konkreten und/oder langfristigen) Zweck sollen die Kompetenzen erworben werden?

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Three.Cell.Five
source: What do students need the acquired skills, abilities or competencies for after the course?
de: Wozu benötigen die Studierenden die erworbenen Kompetenzen nach der Lehrveranstaltung?

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Two.Example.What
source: Students will be able to identify the different genera of the bird of prey species “eagle” on the basis of their plumage
de: Die Studierenden können die verschiedenen Gattungen der Greifvogelart „Adler“ anhand ihres Gefieders bestimmen,

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Two.Example.Whereby
source: ... by accurately classifying the coloring of the individual feathers with the aid of specialist literature
de: … indem sie unter Zuhilfenahme von Fachliteratur die Färbung der einzelnen Federn richtig klassifizieren,

# CreateStructuredLearningOutcome.WhatWherebyWhatFor.Table.Col.Two.Example.WhatFor
source: ... to correctly categorize eagles living in the wild during a bird excursion.
de: … um bei einer Vogelexkursion die in freier Wildbahn lebenden Adler korrekt zu kategorisieren.

source: How are learning outcomes formulated?
de: Wie werden Lernziele formuliert?

source: What-whereby-what-for structure
de: Was-Womit-Wozu-Struktur

# CreateStructuredLearningOutcome.QualitycheckForLearningOutcomes.Title
source: Quality check for the formulation of learning outcomes
de: Qualitätscheck für die Formulierung von Lernzielen

# CreateStructuredLearningOutcome.QualitycheckForLearningOutcomes.Text
source: The following quality check for high-quality formulated learning outcomes serves as a working aid. Answering the reflection questions is helpful for a final critical analysis of the formulated learning outcomes.
de: Der folgende Qualitätscheck für hochwertig formulierte Lernziele dient als Arbeitshilfe. Die Beantwortung der Reflexionsfragen ist hilfreich, um die formulierten Lernziele abschließend kritisch zu analysieren.

source: Quality check
de: Qualitätscheck für Lernziele

# CreateStructuredLearningOutcome.QualityCheck.DescriptionText.Table
source: Table: Quality check for learning outcomes
de: Tabelle: Qualitätscheck für Lernziele

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.One
source: No.
de: Nr.

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Three
source: Reflection question
de: Reflexionsfrage

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Two
source: Category
de: Kategorie

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Two.Cell.One
source: Learning outcomes formulated as learning activities
de: Lernziele als Lerntätigkeit formuliert

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Two.Cell.Two
source: Concrete activity
de: Konkrete Tätigkeit

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Two.Cell.Three
source: Verbs of visibility
de: Verben der Sichtbarkeit

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Two.Cell.Four
source: Verifiable standards
de: Überprüfbare Standards

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Two.Cell.Five
source: Realistic requirements
de: Realistische Anforderungen

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Two.Cell.Six
source: Theoretical / practical tools
de: Theoretische / praktische Werkzeuge

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Two.Cell.Seven
source: Outlook on meaning and purpose
de: Ausblick auf Sinn und Zweck

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Three.Cell.Seven
source: Is it clear what purpose the learning unit serves?
de: Wird deutlich, welchem Sinn und Zweck die Lerneinheit dient?

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Three.Cell.Two
source: Is the course of the activity comprehensible to outsiders?
de: Ist der Ablauf der Tätigkeit für Außenstehende verständlich?

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Three.Cell.One
source: Wer ist der/die wirkliche Akteur:in der Handlung?
de: Sind die Studierenden die wirklichen Akteur:innen der Handlung?

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Three.Cell.Four
source: Can an examination assignment be formulated from the sentence?
de: Lässt sich aus dem Aussagesatz ein Prüfungsauftrag formulieren

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Three.Cell.Five
source: Is the amount of work involved in the learning process proportionate?
de: Steht der Arbeitsaufwand des Lernprozesses in einem angemessen Verhältnis?

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Three.Cell.Six
source: Are the theoretical or practical tools for the action named?
de: Werden die theoretischen oder praktischen Werkzeuge für die Handlung benannt?

# CreateStructuredLearningOutcome.QualityCheck.Table.Col.Three.Cell.Three
source: Do the verbs describe an action on/with an external learning object
de: Beschreiben die Verben ein Tun an/mit einem äußeren Lernobjekt?
